sources_org/lua.org
;-*- mode: Org; fill-column: 110;-*-

* theory
MIT License

.lua
** features
designed primarily for embedded use in applications.

designed as an extension language, to be embedded in a host C program

- scripting
- imperative (procedural, prototype-based, object-oriented)
- functional
- meta
- reflective
- cross-platform, since the interpreter of compiled bytecode is written in ANSI C
- dynamically typed language
- advanced:
  - first-class functions
  - garbage collection
  - closures
  - proper tail calls
  - coercion (automatic conversion between string and number values at run time)
  - coroutines (cooperative multitasking)
  - dynamic module loading.

It ignores spaces (including new lines) and comments between lexical elements (tokens), except as delimiters
 between names and keywords.

Lua programs are much more error prone, due to automatic coercion, accessing of unset variables without an
 exception, and having to check most functions for nil values, rather than just catching the exceptions.

Lua has out-of-the-box support for multiple threads and multiple interpreters in a single thread or process

Lua starts table indices at 1, which is strange for a language designed to interface with C where arrays start
 at 0. (Comment: Ad-hoc , there is no problem to use index 0 or even -1
** terms
- chunk :: The unit of compilation of Lua is called a chunk. Syntactically, a chunk is simply a block. Chunks
 do not nest (unlike blocks). A chunk is an outermost block which you feed to "load". Lua handles a chunk as
 the body of an anonymous function.
-  ::
* scripting
: #!/usr/local/bin/lua
: #!/usr/bin/env lua

lua [options] [script [args]]
| -e stat | executes string stat;                                 |
| -l mod  | "requires" mod and assigns the result to global @mod; |
| -i      | enters interactive mode after running script;         |
| -v      | prints version information;                           |
| -E      | ignores environment variables;                        |
| --      | stops handling options;                               |
| -       | executes stdin as a file and stops handling options.  |

luac - Lua compiler

* compilation and execution
are not interpreted directly from the textual Lua file, but are compiled into bytecode, which is then run on
 the Lua virtual machine.

When Lua loads a chunk, the default value for its _ENV upvalue is the global environment .
