lua.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-14 Tue 12:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org79e8bcf">1. theory</a>
<ul>
<li><a href="#org53900aa">1.1. features</a></li>
<li><a href="#orgc8f59bc">1.2. terms</a></li>
</ul>
</li>
<li><a href="#orga70e081">2. scripting</a></li>
<li><a href="#orgf4e5e45">3. compilation and execution</a></li>
<li><a href="#org3aba8dc">4. operators</a>
<ul>
<li><a href="#org616c424">4.1. Arithmetic Operators</a></li>
<li><a href="#org9d76b41">4.2. Bitwise Operators</a></li>
<li><a href="#orgccd8ada">4.3. Relational Operators</a></li>
<li><a href="#orge6612b2">4.4. logical: and, or, not</a></li>
<li><a href="#orgea4ef6e">4.5. priority</a></li>
</ul>
</li>
<li><a href="#org05f29e3">5. keywords</a></li>
<li><a href="#org405881d">6. types and classes</a>
<ul>
<li><a href="#org8379fb9">6.1. basic types</a></li>
<li><a href="#org7e28bec">6.2. integers</a></li>
<li><a href="#orgd9fe785">6.3. scope</a></li>
<li><a href="#org9a98133">6.4. tables</a>
<ul>
<li><a href="#org6bcb1ed">6.4.1. ex</a></li>
<li><a href="#org617391b">6.4.2. print table</a></li>
</ul>
</li>
<li><a href="#org96bad82">6.5. Metatables and Metamethods</a>
<ul>
<li><a href="#org7105d91">6.5.1. list of events controlled by metatables</a></li>
</ul>
</li>
<li><a href="#orge3a39d3">6.6. OOP</a></li>
<li><a href="#orgdf60f42">6.7. ex1</a></li>
<li><a href="#org9d0ef2d">6.8. syntax shugar ":"</a></li>
</ul>
</li>
<li><a href="#org7a29af7">7. strings</a></li>
<li><a href="#org935e8c3">8. functions</a></li>
<li><a href="#orgd0d4f47">9. helloworld</a></li>
<li><a href="#org6b437b0">10. comments</a></li>
<li><a href="#org5392699">11. control flow</a>
<ul>
<li><a href="#org52e2e80">11.1. basic</a></li>
<li><a href="#orga31400a">11.2. iterate</a></li>
</ul>
</li>
<li><a href="#orgc3e3b04">12. modules</a>
<ul>
<li><a href="#orgb2a7520">12.1. path - list of patterns ANSI C</a></li>
<li><a href="#orgd537de7">12.2. 2</a></li>
<li><a href="#org0f38765">12.3. old 5.0,5.1 way</a></li>
</ul>
</li>
<li><a href="#org8cfa3e3">13. Standard Libraries</a>
<ul>
<li><a href="#org855e081">13.1. basic</a></li>
<li><a href="#org9b19643">13.2. other</a></li>
</ul>
</li>
<li><a href="#orgd5788d4">14. debug</a></li>
<li><a href="#org9b0bfff">15. Documenting</a>
<ul>
<li><a href="#orgd0d5729">15.1. Tags</a></li>
<li><a href="#orgbb6b2e9">15.2. Infered Tags</a></li>
<li><a href="#org859cf35">15.3. LDoc style</a></li>
<li><a href="#orgf38588c">15.4. LDoc tags</a></li>
<li><a href="#orgbabee1b">15.5. table - classic way</a></li>
<li><a href="#org793f3b8">15.6. Doxygen - Generate documentation from source code</a></li>
<li><a href="#org8c6b612">15.7. links</a></li>
</ul>
</li>
<li><a href="#org77be624">16. Style guide</a>
<ul>
<li><a href="#org3f7c760">16.1. basic</a></li>
<li><a href="#org26fcb87">16.2. require</a></li>
<li><a href="#org806926a">16.3. links</a></li>
</ul>
</li>
<li><a href="#org5324faa">17. The Complete Syntax of Lua</a></li>
<li><a href="#org856c361">18. <span class="todo TODO">TODO</span> not errors</a>
<ul>
<li><a href="#orgdcdf794">18.1. undefined variable</a></li>
<li><a href="#orgc962bd8">18.2. key not present</a></li>
</ul>
</li>
<li><a href="#orgdfd5705">19. package managers</a></li>
<li><a href="#org7b6014c">20. links</a></li>
</ul>
</div>
</div>
<p>
;-<b>- mode: Org; fill-column: 110;-</b>-
</p>

<div id="outline-container-org79e8bcf" class="outline-2">
<h2 id="org79e8bcf"><span class="section-number-2">1.</span> theory</h2>
<div class="outline-text-2" id="text-1">
<p>
MIT License
</p>

<p>
.lua
</p>
</div>
<div id="outline-container-org53900aa" class="outline-3">
<h3 id="org53900aa"><span class="section-number-3">1.1.</span> features</h3>
<div class="outline-text-3" id="text-1-1">
<p>
designed primarily for embedded use in applications.
</p>

<p>
designed as an extension language, to be embedded in a host C program
</p>

<ul class="org-ul">
<li>scripting</li>
<li>imperative (procedural, prototype-based, object-oriented)</li>
<li>functional</li>
<li>meta</li>
<li>reflective</li>
<li>cross-platform, since the interpreter of compiled bytecode is written in ANSI C</li>
<li>dynamically typed language</li>
<li>advanced:
<ul class="org-ul">
<li>first-class functions</li>
<li>garbage collection</li>
<li>closures</li>
<li>proper tail calls</li>
<li>coercion (automatic conversion between string and number values at run time)</li>
<li>coroutines (cooperative multitasking)</li>
<li>dynamic module loading.</li>
</ul></li>
</ul>

<p>
It ignores spaces (including new lines) and comments between lexical elements (tokens), except as delimiters
 between names and keywords.
</p>

<p>
Lua programs are much more error prone, due to automatic coercion, accessing of unset variables without an
 exception, and having to check most functions for nil values, rather than just catching the exceptions.
</p>

<p>
Lua has out-of-the-box support for multiple threads and multiple interpreters in a single thread or process
</p>

<p>
Lua starts table indices at 1, which is strange for a language designed to interface with C where arrays start
 at 0. (Comment: Ad-hoc , there is no problem to use index 0 or even -1
</p>
</div>
</div>
<div id="outline-container-orgc8f59bc" class="outline-3">
<h3 id="orgc8f59bc"><span class="section-number-3">1.2.</span> terms</h3>
<div class="outline-text-3" id="text-1-2">
<dl class="org-dl">
<dt>chunk</dt><dd>The unit of compilation of Lua is called a chunk. Syntactically, a chunk is simply a block. Chunks
do not nest (unlike blocks). A chunk is an outermost block which you feed to "load". Lua handles a chunk as
the body of an anonymous function.</dd>
<dt>(no term)</dt><dd>::</dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-orga70e081" class="outline-2">
<h2 id="orga70e081"><span class="section-number-2">2.</span> scripting</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
#!/usr/local/bin/lua
#!/usr/bin/env lua
</pre>


<p>
lua [options] [script [args]]
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">-e stat</td>
<td class="org-left">executes string stat;</td>
</tr>

<tr>
<td class="org-left">-l mod</td>
<td class="org-left">"requires" mod and assigns the result to global @mod;</td>
</tr>

<tr>
<td class="org-left">-i</td>
<td class="org-left">enters interactive mode after running script;</td>
</tr>

<tr>
<td class="org-left">-v</td>
<td class="org-left">prints version information;</td>
</tr>

<tr>
<td class="org-left">-E</td>
<td class="org-left">ignores environment variables;</td>
</tr>

<tr>
<td class="org-left">--</td>
<td class="org-left">stops handling options;</td>
</tr>

<tr>
<td class="org-left">-</td>
<td class="org-left">executes stdin as a file and stops handling options.</td>
</tr>
</tbody>
</table>

<p>
luac - Lua compiler
</p>
</div>
</div>

<div id="outline-container-orgf4e5e45" class="outline-2">
<h2 id="orgf4e5e45"><span class="section-number-2">3.</span> compilation and execution</h2>
<div class="outline-text-2" id="text-3">
<p>
are not interpreted directly from the textual Lua file, but are compiled into bytecode, which is then run on
 the Lua virtual machine.
</p>

<p>
When Lua loads a chunk, the default value for its _ENV upvalue is the global environment .
</p>
</div>
</div>
