lua.html
<div id="outline-container-org3aba8dc" class="outline-2">
<h2 id="org3aba8dc"><span class="section-number-2">4.</span> operators</h2>
<div class="outline-text-2" id="text-4">
<p>
The concatenation ('..') and exponentiation ('^') operators are right associative. All other binary operators
 are left associative.
</p>
</div>
<div id="outline-container-org616c424" class="outline-3">
<h3 id="org616c424"><span class="section-number-3">4.1.</span> Arithmetic Operators</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>+: addition</li>
<li>-: subtraction</li>
<li>*: multiplication</li>
<li>/: float division</li>
<li>//: floor division</li>
<li>%: modulo</li>
<li>^: exponentiation</li>
<li>-: unary minus</li>
</ul>
</div>
</div>

<div id="outline-container-org9d76b41" class="outline-3">
<h3 id="org9d76b41"><span class="section-number-3">4.2.</span> Bitwise Operators</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>&amp;: bitwise AND</li>
<li>|: bitwise OR</li>
<li>~: bitwise exclusive OR</li>
<li>&gt;&gt;: right shift</li>
<li>&lt;&lt;: left shift</li>
<li>~: unary bitwise NOT</li>
</ul>
</div>
</div>

<div id="outline-container-orgccd8ada" class="outline-3">
<h3 id="orgccd8ada"><span class="section-number-3">4.3.</span> Relational Operators</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>==: equality</li>
<li>~=: inequality</li>
<li>&lt;: less than</li>
<li>&gt;: greater than</li>
<li>&lt;=: less or equal</li>
<li>&gt;=: greater or equal</li>
</ul>
</div>
</div>

<div id="outline-container-orge6612b2" class="outline-3">
<h3 id="orge6612b2"><span class="section-number-3">4.4.</span> logical: and, or, not</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>10 or 20            &#x2013;&gt; 10</li>
<li>10 or error()       &#x2013;&gt; 10</li>
<li>nil or "a"          &#x2013;&gt; "a"</li>
<li>nil and 10          &#x2013;&gt; nil</li>
<li>false and error()   &#x2013;&gt; false</li>
<li>false and nil       &#x2013;&gt; false</li>
<li>false or nil        &#x2013;&gt; nil</li>
<li>10 and 20           &#x2013;&gt; 20</li>
</ul>
</div>
</div>
<div id="outline-container-orgea4ef6e" class="outline-3">
<h3 id="orgea4ef6e"><span class="section-number-3">4.5.</span> priority</h3>
<div class="outline-text-3" id="text-4-5">
<p>
from lower to higher:
</p>
<ol class="org-ol">
<li>or</li>
<li>and</li>
<li>&lt;     &gt;     &lt;=    &gt;=    ~=    ==</li>
<li>|</li>
<li>~</li>
<li>&amp;</li>
<li>&lt;&lt;    &gt;&gt;</li>
<li>..</li>
<li>-</li>
<li>/     //    %</li>
<li>unary operators (not   #     -     ~)</li>
<li>^</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org05f29e3" class="outline-2">
<h2 id="org05f29e3"><span class="section-number-2">5.</span> keywords</h2>
<div class="outline-text-2" id="text-5">
<p>
and       break     do        else      elseif    end
    false     for       function  goto      if        in
    local     nil       not       or        repeat    return
    then      true      until     while
</p>
</div>
</div>

<div id="outline-container-org405881d" class="outline-2">
<h2 id="org405881d"><span class="section-number-2">6.</span> types and classes</h2>
<div class="outline-text-2" id="text-6">
<p>
dynamically typed language
</p>
<ul class="org-ul">
<li>All values carry their own type</li>
<li>no type definition</li>
</ul>

<pre class="example">
type(a) - get type
</pre>
</div>
<div id="outline-container-org8379fb9" class="outline-3">
<h3 id="org8379fb9"><span class="section-number-3">6.1.</span> basic types</h3>
<div class="outline-text-3" id="text-6-1">
<pre class="example">
nil, boolean, number, string, function, userdata, thread, and table.
</pre>

<dl class="org-dl">
<dt>nil</dt><dd>singleton - absence of a useful value - (as false)</dd>
<dt>boolean</dt><dd>false and true</dd>
<dt>number</dt><dd>integer numbers and real (floating-point) numbers
<dl class="org-dl">
<dt>integer</dt><dd></dd>

<dt>float</dt><dd></dd>
</dl></dd>
<dt>string</dt><dd>immutable sequences of bytes. 8-bit clean: strings can contain any 8-bit value. encoding-agnostic;
it makes no assumptions about the contents of a string.</dd>
<dt>function</dt><dd>written in Lua and functions written in C</dd>
<dt>userdata</dt><dd>block of raw memory - arbitrary C data to be stored in Lua variables. assignment and identity
test. created and modified only through the C API.
<dl class="org-dl">
<dt>full userdata</dt><dd>an object with a block of memory</dd>
<dt>light userdata</dt><dd>a C pointer value</dd>
</dl></dd>
<dt>thread</dt><dd>used to implement coroutines. not related to operating-system threads</dd>
<dt>table</dt><dd>associative arrays - idexes of any type. can be heterogeneous - can contain values of all types (except nil)
<ul class="org-ul">
<li>can be used to represent ordinary arrays, lists, symbol tables, sets, records, graphs, trees, etc.</li>
<li>a.name as syntactic sugar for a["name"]</li>
</ul></dd>
</dl>

<p>
<b>Tables</b>, <b>functions</b>, <b>threads</b>, and (full) <b>userdata</b> values are objects: variables do not actually contain
 these values, only references to them.
</p>
</div>
</div>
<div id="outline-container-org7e28bec" class="outline-3">
<h3 id="org7e28bec"><span class="section-number-3">6.2.</span> integers</h3>
<div class="outline-text-3" id="text-6-2">
<p>
converts between integer and float automatically as needed.
</p>

<p>
Standard Lua uses 64-bit integers and double-precision (64-bit) floats, but you can also compile Lua so that
 it uses 32-bit integers and/or single-precision (32-bit) floats.
</p>

<p>
valid integer constants are
</p>
<pre class="example">
3   345   0xff   0xBEBADA
</pre>


<p>
Examples of valid float constants are
</p>
<pre class="example">
3.0     3.1416     314.16e-2     0.31416E1     34e1
0x0.1E  0xA23p-4   0X1.921FB54442D18P+1
</pre>
</div>
</div>

<div id="outline-container-orgd9fe785" class="outline-3">
<h3 id="orgd9fe785"><span class="section-number-3">6.3.</span> scope</h3>
<div class="outline-text-3" id="text-6-3">
<p>
kinds of variables in Lua:
</p>
<ul class="org-ul">
<li>global variables</li>
<li>local variables</li>
<li>table fields.</li>
</ul>
</div>
</div>
<div id="outline-container-org9a98133" class="outline-3">
<h3 id="org9a98133"><span class="section-number-3">6.4.</span> tables</h3>
<div class="outline-text-3" id="text-6-4">
<p>
always passed by reference
</p>

<p>
A key (index) can be any value except nil and NaN, including functions.
</p>
</div>
