lua.md


<a id="org24ce2d5"></a>

# operators

The concatenation ('..') and exponentiation ('^') operators are right associative. All other binary operators
 are left associative.


<a id="org8eb2d3a"></a>

## Arithmetic Operators

-   +: addition
-   -: subtraction
-   \*: multiplication
-   /: float division
-   //: floor division
-   %: modulo
-   ^: exponentiation
-   -: unary minus


<a id="org97284fd"></a>

## Bitwise Operators

-   &: bitwise AND
-   |: bitwise OR
-   ~: bitwise exclusive OR
-   >>: right shift
-   <<: left shift
-   ~: unary bitwise NOT


<a id="org0193ca7"></a>

## Relational Operators

-   ==: equality
-   ~=: inequality
-   <: less than
-   >: greater than
-   <=: less or equal
-   >=: greater or equal


<a id="org8853bfd"></a>

## logical: and, or, not

-   10 or 20            &#x2013;> 10
-   10 or error()       &#x2013;> 10
-   nil or "a"          &#x2013;> "a"
-   nil and 10          &#x2013;> nil
-   false and error()   &#x2013;> false
-   false and nil       &#x2013;> false
-   false or nil        &#x2013;> nil
-   10 and 20           &#x2013;> 20


<a id="orgff3bb70"></a>

## priority

from lower to higher:

1.  or
2.  and
3.  <     >     <=    >=    ~=    ==
4.  |
5.  ~
6.  &
7.  <<    >>
8.  ..
9.  -
10. /     //    %
11. unary operators (not   #     -     ~)
12. ^


<a id="org32d9d9a"></a>

# keywords

and       break     do        else      elseif    end
    false     for       function  goto      if        in
    local     nil       not       or        repeat    return
    then      true      until     while


<a id="orga85202b"></a>

# types and classes

dynamically typed language

-   All values carry their own type
-   no type definition

    type(a) - get type


<a id="orga672f6b"></a>

## basic types

    nil, boolean, number, string, function, userdata, thread, and table.

-   **nil:** singleton - absence of a useful value - (as false)
-   **boolean:** false and true
-   **number:** integer numbers and real (floating-point) numbers
    -   **integer:** 
    
    -   **float:**
-   **string:** immutable sequences of bytes. 8-bit clean: strings can contain any 8-bit value. encoding-agnostic;
    it makes no assumptions about the contents of a string.
-   **function:** written in Lua and functions written in C
-   **userdata:** block of raw memory - arbitrary C data to be stored in Lua variables. assignment and identity
    test. created and modified only through the C API.
    -   **full userdata:** an object with a block of memory
    -   **light userdata:** a C pointer value
-   **thread:** used to implement coroutines. not related to operating-system threads
-   **table:** associative arrays - idexes of any type. can be heterogeneous - can contain values of all types (except nil)
    -   can be used to represent ordinary arrays, lists, symbol tables, sets, records, graphs, trees, etc.
    -   a.name as syntactic sugar for a["name"]

**Tables**, **functions**, **threads**, and (full) **userdata** values are objects: variables do not actually contain
 these values, only references to them.


<a id="org89671f0"></a>

## integers

converts between integer and float automatically as needed.

Standard Lua uses 64-bit integers and double-precision (64-bit) floats, but you can also compile Lua so that
 it uses 32-bit integers and/or single-precision (32-bit) floats.

valid integer constants are

    3   345   0xff   0xBEBADA

Examples of valid float constants are

    3.0     3.1416     314.16e-2     0.31416E1     34e1
    0x0.1E  0xA23p-4   0X1.921FB54442D18P+1


<a id="orgf6f9fae"></a>

## scope

kinds of variables in Lua:

-   global variables
-   local variables
-   table fields.


<a id="orgc0d0f62"></a>

## tables

always passed by reference

A key (index) can be any value except nil and NaN, including functions.
