sources_org/lua.org
*** ex
#+BEGIN_SRC lua
a_table = {} -- Creates a new, empty table
a_table = {x = 10}  -- Creates a new table, with one entry mapping "x" to the number 10.
print(a_table["x"]) -- Prints the value associated with the string key, in this case 10.
b_table = a_table
b_table["x"] = 20   -- The value in the table has been changed to 20.
print(b_table["x"]) -- Prints 20.
print(a_table["x"]) -- Also prints 20, because a_table and b_table both refer to the same table.

point = { x = 10, y = 20 }   -- Create new table
print(point["x"])            -- Prints 10
print(point.x)               -- Has exactly the same meaning as line above. The easier-to-read dot notation is just syntactic sugar.

Point = {}

Point.new = function(x, y)
  return {x = x, y = y}  --  return {["x"] = x, ["y"] = y}
end

Point.set_x = function(point, x)
  point.x = x  --  point["x"] = x;
end

array = { "a", "b", "c", "d" }   -- Indices are assigned automatically.
print(array[2])                  -- Prints "b". Automatic indexing in Lua starts at 1.
print(#array)                    -- Prints 4.  # is the length operator for tables and strings.
array[0] = "z"                   -- Zero is a legal index.
print(#array)                    -- Still prints 4, as Lua arrays are 1-based.

ExampleTable =
{
  {1, 2, 3, 4},
  {5, 6, 7, 8}
}
print(ExampleTable[1][3]) -- Prints "3"
print(ExampleTable[2][4]) -- Prints "8"

-- A table can be an array of objects.

function Point(x, y)        -- "Point" object constructor
  return { x = x, y = y }   -- Creates and returns a new object (table)
end
array = { Point(10, 20), Point(30, 40), Point(50, 60) }   -- Creates array of points
                        -- array = { { x = 10, y = 20 }, { x = 30, y = 40 }, { x = 50, y = 60 } };
print(array[2].y)                                         -- Prints 40

#+END_SRC

#+RESULTS:
#+begin_example
10
20
20
10
10
b
4
4
3
8
40
#+end_example

*** print table
#+BEGIN_SRC lua
oprint = print -- origin print
print = function (...)
    if type(...) == "table" then
        local str = ''
        local amount = 0
        for i,v in pairs(...) do
            amount=amount+1
            local pre = type(i) == "string" and i.."=" or ""
            str = str .. pre..tostring(v) .. "\n"
        end
        oprint('#'..amount..':')
        oprint(str)
    else
        oprint(...)
    end
end
print ({x=7, y=9, w=11, h="height", 7, 8, 9})
#+END_SRC

#+RESULTS:
: #7:
: 7
: 8
: 9
: y=9
: h=height
: w=11
: x=7
:

** Metatables and Metamethods
Every value in Lua can have a metatable - table, that defines the behavior of the original value under operations.
- consist of event "__add" key and *metamethods* - value

to retrieve the metamethod for event ev in object o, Lua does:
- rawget (table, index) - Gets the real value of table[index], index may be any value.
- getmetatable (object) - get nil, metatable or metatable.__metatable field.
: rawget(getmetatable(o) or {}, "__ev")

setmetatable (table, metatable) - metatable is nil, removes the metatable of the given table.  If the original
 metatable has a __metatable field, raises an error. This function returns table.

