lua.html
<div id="outline-container-org6bcb1ed" class="outline-4">
<h4 id="org6bcb1ed"><span class="section-number-4">6.4.1.</span> ex</h4>
<div class="outline-text-4" id="text-6-4-1">
<div class="org-src-container">
<pre class="src src-lua">a_table = {} -- Creates a new, empty table
a_table = {x = 10}  -- Creates a new table, with one entry mapping "x" to the number 10.
print(a_table["x"]) -- Prints the value associated with the string key, in this case 10.
b_table = a_table
b_table["x"] = 20   -- The value in the table has been changed to 20.
print(b_table["x"]) -- Prints 20.
print(a_table["x"]) -- Also prints 20, because a_table and b_table both refer to the same table.

point = { x = 10, y = 20 }   -- Create new table
print(point["x"])            -- Prints 10
print(point.x)               -- Has exactly the same meaning as line above. The easier-to-read dot notation is just syntactic sugar.

Point = {}

Point.new = function(x, y)
  return {x = x, y = y}  --  return {["x"] = x, ["y"] = y}
end

Point.set_x = function(point, x)
  point.x = x  --  point["x"] = x;
end

array = { "a", "b", "c", "d" }   -- Indices are assigned automatically.
print(array[2])                  -- Prints "b". Automatic indexing in Lua starts at 1.
print(#array)                    -- Prints 4.  # is the length operator for tables and strings.
array[0] = "z"                   -- Zero is a legal index.
print(#array)                    -- Still prints 4, as Lua arrays are 1-based.

ExampleTable =
{
  {1, 2, 3, 4},
  {5, 6, 7, 8}
}
print(ExampleTable[1][3]) -- Prints "3"
print(ExampleTable[2][4]) -- Prints "8"

-- A table can be an array of objects.

function Point(x, y)        -- "Point" object constructor
  return { x = x, y = y }   -- Creates and returns a new object (table)
end
array = { Point(10, 20), Point(30, 40), Point(50, 60) }   -- Creates array of points
                        -- array = { { x = 10, y = 20 }, { x = 30, y = 40 }, { x = 50, y = 60 } };
print(array[2].y)                                         -- Prints 40

</pre>
</div>
</div>
</div>

<div id="outline-container-org617391b" class="outline-4">
<h4 id="org617391b"><span class="section-number-4">6.4.2.</span> print table</h4>
<div class="outline-text-4" id="text-6-4-2">
<div class="org-src-container">
<pre class="src src-lua">oprint = print -- origin print
print = function (...)
    if type(...) == "table" then
        local str = ''
        local amount = 0
        for i,v in pairs(...) do
            amount=amount+1
            local pre = type(i) == "string" and i.."=" or ""
            str = str .. pre..tostring(v) .. "\n"
        end
        oprint('#'..amount..':')
        oprint(str)
    else
        oprint(...)
    end
end
print ({x=7, y=9, w=11, h="height", 7, 8, 9})
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org96bad82" class="outline-3">
<h3 id="org96bad82"><span class="section-number-3">6.5.</span> Metatables and Metamethods</h3>
<div class="outline-text-3" id="text-6-5">
<p>
Every value in Lua can have a metatable - table, that defines the behavior of the original value under operations.
</p>
<ul class="org-ul">
<li>consist of event "_<sub>add</sub>" key and <b>metamethods</b> - value</li>
</ul>

<p>
to retrieve the metamethod for event ev in object o, Lua does:
</p>
<ul class="org-ul">
<li>rawget (table, index) - Gets the real value of table[index], index may be any value.</li>
<li>getmetatable (object) - get nil, metatable or metatable._<sub>metatable</sub> field.</li>
</ul>
<pre class="example">
rawget(getmetatable(o) or {}, "__ev")
</pre>


<p>
setmetatable (table, metatable) - metatable is nil, removes the metatable of the given table.  If the original
 metatable has a _<sub>metatable</sub> field, raises an error. This function returns table.
</p>
</div>
