lua.html

<div id="outline-container-org7105d91" class="outline-4">
<h4 id="org7105d91"><span class="section-number-4">6.5.1.</span> list of events controlled by metatables</h4>
<div class="outline-text-4" id="text-6-5-1">
<ul class="org-ul">
<li>_<sub>add</sub>: the addition (+) operation. If any operand for an addition is not a number (nor a string coercible to a number), Lua will try to call a metamethod. First, Lua will check the first operand (even if it is valid). If that operand does not define a metamethod for _<sub>add</sub>, then Lua will check the second operand. If Lua can find a metamethod, it calls the metamethod with the two operands as arguments, and the result of the call (adjusted to one value) is the result of the operation. Otherwise, it raises an error.</li>
<li>_<sub>sub</sub>: the subtraction (-) operation. Behavior similar to the addition operation.</li>
<li>_<sub>mul</sub>: the multiplication (*) operation. Behavior similar to the addition operation.</li>
<li>_<sub>div</sub>: the division (/) operation. Behavior similar to the addition operation.</li>
<li>_<sub>mod</sub>: the modulo (%) operation. Behavior similar to the addition operation.</li>
<li>_<sub>pow</sub>: the exponentiation (^) operation. Behavior similar to the addition operation.</li>
<li>_<sub>unm</sub>: the negation (unary -) operation. Behavior similar to the addition operation.</li>
<li>_<sub>idiv</sub>: the floor division (//) operation. Behavior similar to the addition operation.</li>
<li>_<sub>band</sub>: the bitwise AND (&amp;) operation. Behavior similar to the addition operation, except that Lua will try a metamethod if any operand is neither an integer nor a value coercible to an integer (see §3.4.3).</li>
<li>_<sub>bor</sub>: the bitwise OR (|) operation. Behavior similar to the bitwise AND operation.</li>
<li>_<sub>bxor</sub>: the bitwise exclusive OR (binary ~) operation. Behavior similar to the bitwise AND operation.</li>
<li>_<sub>bnot</sub>: the bitwise NOT (unary ~) operation. Behavior similar to the bitwise AND operation.</li>
<li>_<sub>shl</sub>: the bitwise left shift (&lt;&lt;) operation. Behavior similar to the bitwise AND operation.</li>
<li>_<sub>shr</sub>: the bitwise right shift (&gt;&gt;) operation. Behavior similar to the bitwise AND operation.</li>
<li>_<sub>concat</sub>: the concatenation (..) operation. Behavior similar to the addition operation, except that Lua will try a metamethod if any operand is neither a string nor a number (which is always coercible to a string).</li>
<li>_<sub>len</sub>: the length (#) operation. If the object is not a string, Lua will try its metamethod. If there is a metamethod, Lua calls it with the object as argument, and the result of the call (always adjusted to one value) is the result of the operation. If there is no metamethod but the object is a table, then Lua uses the table length operation (see §3.4.7). Otherwise, Lua raises an error.</li>
<li>_<sub>eq</sub>: the equal (==) operation. Behavior similar to the addition operation, except that Lua will try a metamethod only when the values being compared are either both tables or both full userdata and they are not primitively equal. The result of the call is always converted to a boolean.</li>
<li>_<sub>lt</sub>: the less than (&lt;) operation. Behavior similar to the addition operation, except that Lua will try a metamethod only when the values being compared are neither both numbers nor both strings. The result of the call is always converted to a boolean.</li>
<li>_<sub>le</sub>: the less equal (&lt;=) operation. Unlike other operations, the less-equal operation can use two different events. First, Lua looks for the _<sub>le</sub> metamethod in both operands, like in the less than operation. If it cannot find such a metamethod, then it will try the _<sub>lt</sub> metamethod, assuming that a &lt;= b is equivalent to not (b &lt; a). As with the other comparison operators, the result is always a boolean. (This use of the _<sub>lt</sub> event can be removed in future versions; it is also slower than a real _<sub>le</sub> metamethod.)</li>
<li>_<sub>index</sub>: The indexing access operation table[key]. This event happens when table is not a table or when key is not present in table. The metamethod is looked up in table.</li>
<li>_<sub>newindex</sub>: The indexing assignment table[key] = value. Like the index event, this event happens when table is not a table or when key is not present in table. The metamethod is looked up in table.</li>
<li>_<sub>call</sub>: The call operation func(args). This event happens when Lua tries to call a non-function value (that is, func is not a function). The metamethod is looked up in func. If present, the metamethod is called with func as its first argument, followed by the arguments of the original call (args). All results of the call are the result of the operation. (This is the only metamethod that allows multiple results.)</li>
</ul>
</div>
</div>
</div>
