lua.md


<a id="org83de4bb"></a>

### list of events controlled by metatables

-   \_<sub>add</sub>: the addition (+) operation. If any operand for an addition is not a number (nor a string coercible to a number), Lua will try to call a metamethod. First, Lua will check the first operand (even if it is valid). If that operand does not define a metamethod for \_<sub>add</sub>, then Lua will check the second operand. If Lua can find a metamethod, it calls the metamethod with the two operands as arguments, and the result of the call (adjusted to one value) is the result of the operation. Otherwise, it raises an error.
-   \_<sub>sub</sub>: the subtraction (-) operation. Behavior similar to the addition operation.
-   \_<sub>mul</sub>: the multiplication (\*) operation. Behavior similar to the addition operation.
-   \_<sub>div</sub>: the division (/) operation. Behavior similar to the addition operation.
-   \_<sub>mod</sub>: the modulo (%) operation. Behavior similar to the addition operation.
-   \_<sub>pow</sub>: the exponentiation (^) operation. Behavior similar to the addition operation.
-   \_<sub>unm</sub>: the negation (unary -) operation. Behavior similar to the addition operation.
-   \_<sub>idiv</sub>: the floor division (//) operation. Behavior similar to the addition operation.
-   \_<sub>band</sub>: the bitwise AND (&) operation. Behavior similar to the addition operation, except that Lua will try a metamethod if any operand is neither an integer nor a value coercible to an integer (see §3.4.3).
-   \_<sub>bor</sub>: the bitwise OR (|) operation. Behavior similar to the bitwise AND operation.
-   \_<sub>bxor</sub>: the bitwise exclusive OR (binary ~) operation. Behavior similar to the bitwise AND operation.
-   \_<sub>bnot</sub>: the bitwise NOT (unary ~) operation. Behavior similar to the bitwise AND operation.
-   \_<sub>shl</sub>: the bitwise left shift (<<) operation. Behavior similar to the bitwise AND operation.
-   \_<sub>shr</sub>: the bitwise right shift (>>) operation. Behavior similar to the bitwise AND operation.
-   \_<sub>concat</sub>: the concatenation (..) operation. Behavior similar to the addition operation, except that Lua will try a metamethod if any operand is neither a string nor a number (which is always coercible to a string).
-   \_<sub>len</sub>: the length (#) operation. If the object is not a string, Lua will try its metamethod. If there is a metamethod, Lua calls it with the object as argument, and the result of the call (always adjusted to one value) is the result of the operation. If there is no metamethod but the object is a table, then Lua uses the table length operation (see §3.4.7). Otherwise, Lua raises an error.
-   \_<sub>eq</sub>: the equal (==) operation. Behavior similar to the addition operation, except that Lua will try a metamethod only when the values being compared are either both tables or both full userdata and they are not primitively equal. The result of the call is always converted to a boolean.
-   \_<sub>lt</sub>: the less than (<) operation. Behavior similar to the addition operation, except that Lua will try a metamethod only when the values being compared are neither both numbers nor both strings. The result of the call is always converted to a boolean.
-   \_<sub>le</sub>: the less equal (<=) operation. Unlike other operations, the less-equal operation can use two different events. First, Lua looks for the \_<sub>le</sub> metamethod in both operands, like in the less than operation. If it cannot find such a metamethod, then it will try the \_<sub>lt</sub> metamethod, assuming that a <= b is equivalent to not (b < a). As with the other comparison operators, the result is always a boolean. (This use of the \_<sub>lt</sub> event can be removed in future versions; it is also slower than a real \_<sub>le</sub> metamethod.)
-   \_<sub>index</sub>: The indexing access operation table[key]. This event happens when table is not a table or when key is not present in table. The metamethod is looked up in table.
-   \_<sub>newindex</sub>: The indexing assignment table[key] = value. Like the index event, this event happens when table is not a table or when key is not present in table. The metamethod is looked up in table.
-   \_<sub>call</sub>: The call operation func(args). This event happens when Lua tries to call a non-function value (that is, func is not a function). The metamethod is looked up in func. If present, the metamethod is called with func as its first argument, followed by the arguments of the original call (args). All results of the call are the result of the operation. (This is the only metamethod that allows multiple results.)
