sources_org/lua.org
** ex1
#+BEGIN_SRC lua
local Vector = {}
local VectorMeta = { __index = Vector}

function Vector.new(x, y, z)    -- The constructor
  return setmetatable({x = x, y = y, z = z}, VectorMeta)
end

function Vector.magnitude(self)     -- Another method
  return math.sqrt(self.x^2 + self.y^2 + self.z^2)
end

local vec = Vector.new(0, 1, 0) -- Create a vector
print(vec.magnitude(vec))       -- Call a method (output: 1)
print(vec.x)                    -- Access a member variable (output: 0)
#+END_SRC

#+RESULTS:
: 1.0
: 0

** syntax shugar ":"

#+BEGIN_SRC lua
-- Meta class
Rectangle = {area = 0, length = 0, breadth = 0}

-- Derived class method new

function Rectangle:new (o,length,breadth)
   o = o or {}
   setmetatable(o, self)
   self.__index = self
   self.length = length or 0
   self.breadth = breadth or 0
   self.area = length*breadth;
   return o
end

-- Derived class method printArea

function Rectangle:printArea ()
   print("The area of Rectangle is ",self.area)
end

r = Rectangle:new(nil,10,20)

print(r.length)
#+END_SRC

#+RESULTS:
: 10

* strings
string concatenation operator by two dots ('..').

The length operator is denoted by the unary prefix operator #.
#+BEGIN_SRC lua
a = 'alo\n123"'
a = "alo\n123\""
a = '\97lo\10\04923"'
-- no new line
a = [[alo
     123"]]
print(a)
print('-------')
a = [==[
     alo
   123"]==]
print(a)
print('-------')
print(#a)
#+END_SRC

#+RESULTS:
: alo
:      123"
: -------
:      alo
:    123"
: -------
: 16

* functions
allow to ommit parenthesis, but it is bad style



#+BEGIN_SRC lua
function factorial(n)
  local x = 1
  for i = 2, n do
    x = x * i
  end
  return x
end

--  print function's behavior is modified:

do
  local oldprint = print
  -- Store current print function as oldprint
  function print(s)
    --[[ Redefine print function. The usual print function can still be used
      through oldprint. The new one has only one argument.]]
    oldprint(s == "foo" and "bar" or s)
  end
end

-- closures

function addto(x)
  -- Return a new function that adds x to the argument
  return function(y)
    --[=[ When we refer to the variable x, which is outside the current
      scope and whose lifetime would be shorter than that of this anonymous
      function, Lua creates a closure.]=]
    return x + y
  end
end
fourplus = addto(4)
print(fourplus(3))  -- Prints 7

--This can also be achieved by calling the function in the following way:
print(addto(4)(3))
--[[ This is because we are calling the returned function from 'addto(4)' with the argument '3' directly.
  This also helps to reduce data cost and up performance if being called iteratively.
]]
#+END_SRC

#+RESULTS:
: 7
: 7

style:

#+BEGIN_SRC lua
-- bad
local nope = function(name, options)
   -- ...stuff...
end

-- good
local function yup(name, options)
   -- ...stuff...
end
#+END_SRC
* helloworld
: print("Hello, World!") -- or print 'Hello, World!'
* comments
single line: --, multiline:
: --[[
: ]]--

* control flow
- stat ::= *while* exp *do* block *end*
- stat ::= *repeat* block *until* exp
- stat ::= if exp then block {elseif exp then block} [else block] end

: break
: ::label::
: goto label
** basic
#+begin_src lua :results output :exports both
if condition then
	--statement body
elseif condition then
	--statement body
else -- optional
	--optional default statement body
end

while condition do
  --statements
end

repeat
  --statements
until condition

for i = first, last, delta do  --delta may be negative, allowing the for loop to count down or up
  --statements
  --example: print(i)
end

for key, value in pairs(_G) do
  print(key, value)
end

local grid = {
  { 11, 12, 13 },
  { 21, 22, 23 },
  { 31, 32, 33 }
}

for y, row in pairs(grid) do
  for x, value in pairs(row) do
    print(x, y, value)
  end
end

#+end_src

#+RESULTS:
: as

** iterate
#+begin_src lua :results output :exports both
for i,v in ipairs({3,3,2}) do
   print(i,v)
end
#+end_src

#+RESULTS:
: 1	3
: 2	3
: 3	2

* modules
require (modname)
- searches for the file in a path
- avoid duplicating the work

  well behaved module has necessary provisions to return this table on require.
