lua.html

<div id="outline-container-orge3a39d3" class="outline-3">
<h3 id="orge3a39d3"><span class="section-number-3">6.6.</span> OOP</h3>
<div class="outline-text-3" id="text-6-6">
<p>
object-oriented programming can be emulated using functions and tables
</p>
</div>
</div>
<div id="outline-container-orgdf60f42" class="outline-3">
<h3 id="orgdf60f42"><span class="section-number-3">6.7.</span> ex1</h3>
<div class="outline-text-3" id="text-6-7">
<div class="org-src-container">
<pre class="src src-lua">local Vector = {}
local VectorMeta = { __index = Vector}

function Vector.new(x, y, z)    -- The constructor
  return setmetatable({x = x, y = y, z = z}, VectorMeta)
end

function Vector.magnitude(self)     -- Another method
  return math.sqrt(self.x^2 + self.y^2 + self.z^2)
end

local vec = Vector.new(0, 1, 0) -- Create a vector
print(vec.magnitude(vec))       -- Call a method (output: 1)
print(vec.x)                    -- Access a member variable (output: 0)
</pre>
</div>
</div>
</div>

<div id="outline-container-org9d0ef2d" class="outline-3">
<h3 id="org9d0ef2d"><span class="section-number-3">6.8.</span> syntax shugar ":"</h3>
<div class="outline-text-3" id="text-6-8">
<div class="org-src-container">
<pre class="src src-lua">-- Meta class
Rectangle = {area = 0, length = 0, breadth = 0}

-- Derived class method new

function Rectangle:new (o,length,breadth)
   o = o or {}
   setmetatable(o, self)
   self.__index = self
   self.length = length or 0
   self.breadth = breadth or 0
   self.area = length*breadth;
   return o
end

-- Derived class method printArea

function Rectangle:printArea ()
   print("The area of Rectangle is ",self.area)
end

r = Rectangle:new(nil,10,20)

print(r.length)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7a29af7" class="outline-2">
<h2 id="org7a29af7"><span class="section-number-2">7.</span> strings</h2>
<div class="outline-text-2" id="text-7">
<p>
string concatenation operator by two dots ('..').
</p>

<p>
The length operator is denoted by the unary prefix operator #.
</p>
<div class="org-src-container">
<pre class="src src-lua">a = 'alo\n123"'
a = "alo\n123\""
a = '\97lo\10\04923"'
-- no new line
a = [[alo
     123"]]
print(a)
print('-------')
a = [==[
     alo
   123"]==]
print(a)
print('-------')
print(#a)
</pre>
</div>
</div>
</div>

<div id="outline-container-org935e8c3" class="outline-2">
<h2 id="org935e8c3"><span class="section-number-2">8.</span> functions</h2>
<div class="outline-text-2" id="text-8">
<p>
allow to ommit parenthesis, but it is bad style
</p>



<div class="org-src-container">
<pre class="src src-lua">function factorial(n)
  local x = 1
  for i = 2, n do
    x = x * i
  end
  return x
end

--  print function's behavior is modified:

do
  local oldprint = print
  -- Store current print function as oldprint
  function print(s)
    --[[ Redefine print function. The usual print function can still be used
      through oldprint. The new one has only one argument.]]
    oldprint(s == "foo" and "bar" or s)
  end
end

-- closures

function addto(x)
  -- Return a new function that adds x to the argument
  return function(y)
    --[=[ When we refer to the variable x, which is outside the current
      scope and whose lifetime would be shorter than that of this anonymous
      function, Lua creates a closure.]=]
    return x + y
  end
end
fourplus = addto(4)
print(fourplus(3))  -- Prints 7

--This can also be achieved by calling the function in the following way:
print(addto(4)(3))
--[[ This is because we are calling the returned function from 'addto(4)' with the argument '3' directly.
  This also helps to reduce data cost and up performance if being called iteratively.
]]
</pre>
</div>

<p>
style:
</p>

<div class="org-src-container">
<pre class="src src-lua">-- bad
local nope = function(name, options)
   -- ...stuff...
end

-- good
local function yup(name, options)
   -- ...stuff...
end
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd0d4f47" class="outline-2">
<h2 id="orgd0d4f47"><span class="section-number-2">9.</span> helloworld</h2>
<div class="outline-text-2" id="text-9">
<pre class="example">
print("Hello, World!") -- or print 'Hello, World!'
</pre>
</div>
</div>
<div id="outline-container-org6b437b0" class="outline-2">
<h2 id="org6b437b0"><span class="section-number-2">10.</span> comments</h2>
<div class="outline-text-2" id="text-10">
<p>
single line: &#x2013;, multiline:
</p>
<pre class="example">
--[[
]]--
</pre>
</div>
</div>

<div id="outline-container-org5392699" class="outline-2">
<h2 id="org5392699"><span class="section-number-2">11.</span> control flow</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>stat ::= <b>while</b> exp <b>do</b> block <b>end</b></li>
<li>stat ::= <b>repeat</b> block <b>until</b> exp</li>
<li>stat ::= if exp then block {elseif exp then block} [else block] end</li>
</ul>

<pre class="example">
break
::label::
goto label
</pre>
</div>
<div id="outline-container-org52e2e80" class="outline-3">
<h3 id="org52e2e80"><span class="section-number-3">11.1.</span> basic</h3>
<div class="outline-text-3" id="text-11-1">
<div class="org-src-container">
<pre class="src src-lua">if condition then
	--statement body
elseif condition then
	--statement body
else -- optional
	--optional default statement body
end

while condition do
  --statements
end

repeat
  --statements
until condition

for i = first, last, delta do  --delta may be negative, allowing the for loop to count down or up
  --statements
  --example: print(i)
end

for key, value in pairs(_G) do
  print(key, value)
end

local grid = {
  { 11, 12, 13 },
  { 21, 22, 23 },
  { 31, 32, 33 }
}

for y, row in pairs(grid) do
  for x, value in pairs(row) do
    print(x, y, value)
  end
end

</pre>
</div>

<pre class="example">
as
</pre>
</div>
</div>

<div id="outline-container-orga31400a" class="outline-3">
<h3 id="orga31400a"><span class="section-number-3">11.2.</span> iterate</h3>
<div class="outline-text-3" id="text-11-2">
<div class="org-src-container">
<pre class="src src-lua">for i,v in ipairs({3,3,2}) do
   print(i,v)
end
</pre>
</div>

<pre class="example">
1	3
2	3
3	2
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc3e3b04" class="outline-2">
<h2 id="orgc3e3b04"><span class="section-number-2">12.</span> modules</h2>
<div class="outline-text-2" id="text-12">
<p>
require (modname)
</p>
<ul class="org-ul">
<li>searches for the file in a path</li>
<li><p>
avoid duplicating the work
</p>

<p>
well behaved module has necessary provisions to return this table on require.
</p></li>
</ul>
</div>
