lua.md


<a id="org9ebab90"></a>

## OOP

object-oriented programming can be emulated using functions and tables


<a id="org6e734b0"></a>

## ex1

    local Vector = {}
    local VectorMeta = { __index = Vector}
    
    function Vector.new(x, y, z)    -- The constructor
      return setmetatable({x = x, y = y, z = z}, VectorMeta)
    end
    
    function Vector.magnitude(self)     -- Another method
      return math.sqrt(self.x^2 + self.y^2 + self.z^2)
    end
    
    local vec = Vector.new(0, 1, 0) -- Create a vector
    print(vec.magnitude(vec))       -- Call a method (output: 1)
    print(vec.x)                    -- Access a member variable (output: 0)


<a id="org933da38"></a>

## syntax shugar ":"

    -- Meta class
    Rectangle = {area = 0, length = 0, breadth = 0}
    
    -- Derived class method new
    
    function Rectangle:new (o,length,breadth)
       o = o or {}
       setmetatable(o, self)
       self.__index = self
       self.length = length or 0
       self.breadth = breadth or 0
       self.area = length*breadth;
       return o
    end
    
    -- Derived class method printArea
    
    function Rectangle:printArea ()
       print("The area of Rectangle is ",self.area)
    end
    
    r = Rectangle:new(nil,10,20)
    
    print(r.length)


<a id="org4d492b0"></a>

# strings

string concatenation operator by two dots ('..').

The length operator is denoted by the unary prefix operator #.

    a = 'alo\n123"'
    a = "alo\n123\""
    a = '\97lo\10\04923"'
    -- no new line
    a = [[alo
         123"]]
    print(a)
    print('-------')
    a = [==[
         alo
       123"]==]
    print(a)
    print('-------')
    print(#a)


<a id="org4e862fc"></a>

# functions

allow to ommit parenthesis, but it is bad style

    function factorial(n)
      local x = 1
      for i = 2, n do
        x = x * i
      end
      return x
    end
    
    --  print function's behavior is modified:
    
    do
      local oldprint = print
      -- Store current print function as oldprint
      function print(s)
        --[[ Redefine print function. The usual print function can still be used
          through oldprint. The new one has only one argument.]]
        oldprint(s == "foo" and "bar" or s)
      end
    end
    
    -- closures
    
    function addto(x)
      -- Return a new function that adds x to the argument
      return function(y)
        --[=[ When we refer to the variable x, which is outside the current
          scope and whose lifetime would be shorter than that of this anonymous
          function, Lua creates a closure.]=]
        return x + y
      end
    end
    fourplus = addto(4)
    print(fourplus(3))  -- Prints 7
    
    --This can also be achieved by calling the function in the following way:
    print(addto(4)(3))
    --[[ This is because we are calling the returned function from 'addto(4)' with the argument '3' directly.
      This also helps to reduce data cost and up performance if being called iteratively.
    ]]

style:

    -- bad
    local nope = function(name, options)
       -- ...stuff...
    end
    
    -- good
    local function yup(name, options)
       -- ...stuff...
    end


<a id="orgc42a516"></a>

# helloworld

    print("Hello, World!") -- or print 'Hello, World!'


<a id="org87ca516"></a>

# comments

single line: &#x2013;, multiline:

    --[[
    ]]--


<a id="org01d4bee"></a>

# control flow

-   stat ::= **while** exp **do** block **end**
-   stat ::= **repeat** block **until** exp
-   stat ::= if exp then block {elseif exp then block} [else block] end

    break
    ::label::
    goto label


<a id="orgf5d30e8"></a>

## basic

    if condition then
    	--statement body
    elseif condition then
    	--statement body
    else -- optional
    	--optional default statement body
    end
    
    while condition do
      --statements
    end
    
    repeat
      --statements
    until condition
    
    for i = first, last, delta do  --delta may be negative, allowing the for loop to count down or up
      --statements
      --example: print(i)
    end
    
    for key, value in pairs(_G) do
      print(key, value)
    end
    
    local grid = {
      { 11, 12, 13 },
      { 21, 22, 23 },
      { 31, 32, 33 }
    }
    
    for y, row in pairs(grid) do
      for x, value in pairs(row) do
        print(x, y, value)
      end
    end

    as


<a id="orgacf9b3e"></a>

## iterate

    for i,v in ipairs({3,3,2}) do
       print(i,v)
    end

    1	3
    2	3
    3	2


<a id="orga48916b"></a>

# modules

require (modname)

-   searches for the file in a path
-   avoid duplicating the work
    
    well behaved module has necessary provisions to return this table on require.
