lua.html
<div id="outline-container-orgb2a7520" class="outline-3">
<h3 id="orgb2a7520"><span class="section-number-3">12.1.</span> path - list of patterns ANSI C</h3>
<div class="outline-text-3" id="text-12-1">
<ul class="org-ul">
<li>components in a path are separated by semicolons ";"</li>
</ul>

<p>
?;?.lua;c:\windows\?;/usr/local/lua/?/?.lua
</p>

<p>
require"lili" will try to open the following files:
</p>
<ul class="org-ul">
<li>lili</li>
<li>lili.lua</li>
<li>c:\windows\lili</li>
<li>/usr/local/lua/lili/lili.lua</li>
</ul>
</div>
</div>
<div id="outline-container-orgd537de7" class="outline-3">
<h3 id="orgd537de7"><span class="section-number-3">12.2.</span> 2</h3>
<div class="outline-text-3" id="text-12-2">
<div class="org-src-container">
<pre class="src src-lua">local mymath =  {}

function mymath.add(a,b)
   print(a+b)
end

return mymath
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lua">mymathmodule = require("mymath")
mymathmodule.add(10,20)
</pre>
</div>
</div>
</div>
<div id="outline-container-org0f38765" class="outline-3">
<h3 id="org0f38765"><span class="section-number-3">12.3.</span> old 5.0,5.1 way</h3>
<div class="outline-text-3" id="text-12-3">
<div class="org-src-container">
<pre class="src src-lua">module("mymath", package.seeall)

function mymath.add(a,b)
   print(a+b)
end

function mymath.sub(a,b)
   print(a-b)
end

</pre>
</div>

<p>
usage:
</p>
<div class="org-src-container">
<pre class="src src-lua">require "mymath.add"
mymath.add.test2()
</pre>
</div>

<p>
alternative
</p>
<div class="org-src-container">
<pre class="src src-lua">-- file: finance/BankAccount.lua

local M = {}; M.__index = M

local function construct()
  local self = setmetatable({balance = 0}, M)
  return self
end
setmetatable(M, {__call = construct})

function M:add(value) self.balance = self.balance + value end

return M
</pre>
</div>

<p>
usage:
</p>
<div class="org-src-container">
<pre class="src src-lua">local BankAccount = require "finance.BankAccount"
local account = BankAccount()
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8cfa3e3" class="outline-2">
<h2 id="org8cfa3e3"><span class="section-number-2">13.</span> Standard Libraries</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org855e081" class="outline-3">
<h3 id="org855e081"><span class="section-number-3">13.1.</span> basic</h3>
<div class="outline-text-3" id="text-13-1">
<ul class="org-ul">
<li>assert (v [, message])		Calls <b>error</b> if <b>v</b> is false.</li>
<li>collectgarbage ([opt [, arg]])	opt:"collect", "stop", "restart", "count", "step", "setpause", "setstepmul", "isrunning"</li>
<li>dofile ([filename])			Opens the named file and executes its contents as a Lua chunk.</li>
<li>error (message [, level])		levels = 1 (default) - position where error was called, 2 - function that call error</li>
<li>_G					variable of type table - holds the global environment</li>
<li>getmetatable (object)		not have = nil, the object's metatable _<sub>metatable</sub> field or metatable of the object</li>
<li>ipairs (t)				used in:  for i,v in ipairs(t) do  (1,t[1]), (2,t[2]), &#x2026;,</li>
<li>load (chunk [, chunkname [, mode [, env]]]) chunk is a string of function that return string.</li>
<li>loadfile ([filename [, mode [, env]]])  gets the chunk from file filename</li>
<li>next (table [, index])		returns the next index of the table and its associated value.</li>
<li>pairs (t)				for k,v in pairs(t) do body end - over all key–value pairs of table t. <b>next</b></li>
<li>pcall (f [, arg1, ···])		protected mode - error inside f is not propagated. ret: (true, return) or (false, message)</li>
<li>print (···)				any number of arguments, to stdout. <b>tostring</b>. for quick way only. use <b>string.format</b> and <b>io.write</b>.</li>
<li>rawequal (v1, v2)			bool, v1 is equal to v2, without invoking the _<sub>eq</sub> metamethod.</li>
<li>rawget (table, index)		table[index], without invoking the _<sub>index</sub> metamethod. index - any value.</li>
<li>rawlen (v)				v - string or table, without invoking the _<sub>len</sub> metamethod. integer</li>
<li>rawset (table, index, value)		table[index], without invoking the _<sub>newindex</sub>. returns table.</li>
<li>select (index, ···)			number - return next elemets &#x2026; after number, '#' - count of &#x2026; elements.</li>
<li>setmetatable (table, metatable)</li>
<li>tonumber (e [, base])		base - any integer between 2 and 36. return int or nil.</li>
<li>tostring (v)				call _<sub>tostring</sub>.</li>
<li>type (v)				return type coded as a string. "nil", "number", "string", "boolean", "table", "function", "thread", and "userdata".</li>
<li>_VERSION				string - the running Lua version.</li>
<li>xpcall (f, msgh [, arg1, ···])	This function is similar to pcall, except that it sets a new message handler msgh.</li>
</ul>

<p>
other
</p>
<ul class="org-ul">
<li>require (modname)</li>
</ul>
</div>
</div>
<div id="outline-container-org9b19643" class="outline-3">
<h3 id="org9b19643"><span class="section-number-3">13.2.</span> other</h3>
<div class="outline-text-3" id="text-13-2">
<ul class="org-ul">
<li>coroutine.</li>
<li>package.</li>
<li>string.</li>
<li>utf8.</li>
<li>table.</li>
<li>math.</li>
<li>io.</li>
<li>file:</li>
<li>os:</li>
<li>debug.</li>
<li></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd5788d4" class="outline-2">
<h2 id="orgd5788d4"><span class="section-number-2">14.</span> debug</h2>
<div class="outline-text-2" id="text-14">
<p>
assert (v [, message])  - Calls error if the value of its argument v is false
</p>
</div>
</div>
<div id="outline-container-org9b0bfff" class="outline-2">
<h2 id="org9b0bfff"><span class="section-number-2">15.</span> Documenting</h2>
<div class="outline-text-2" id="text-15">
<ul class="org-ul">
<li>luadoc 1999-2008 <a href="http://keplerproject.github.io/luadoc/">http://keplerproject.github.io/luadoc/</a></li>
<li>ldoc <a href="http://stevedonovan.github.io/ldoc/">http://stevedonovan.github.io/ldoc/</a>
<ul class="org-ul">
<li>LDoc is a LuaDoc-compatible documentation generator which can also process C extension source</li>
</ul></li>
<li>ExpLua - code comment format and a tool for extracting said comments and exporting HTML, LaTeX, and whatnot</li>
</ul>


<p>
LuaDoc looks for the sequence of three minus signs (&#x2014;). This sequence of characters indicates the beginning
of a documented comment. The documentation ends with the first line of code found.
</p>
</div>
