lua.md


<a id="org91842c4"></a>

## path - list of patterns ANSI C

-   components in a path are separated by semicolons ";"

?;?.lua;c:\windows\\?;/usr/local/lua/?/?.lua

require"lili" will try to open the following files:

-   lili
-   lili.lua
-   c:\windows\lili
-   /usr/local/lua/lili/lili.lua


<a id="org02b432a"></a>

## 2

    local mymath =  {}
    
    function mymath.add(a,b)
       print(a+b)
    end
    
    return mymath

    mymathmodule = require("mymath")
    mymathmodule.add(10,20)


<a id="orgc3fa236"></a>

## old 5.0,5.1 way

    module("mymath", package.seeall)
    
    function mymath.add(a,b)
       print(a+b)
    end
    
    function mymath.sub(a,b)
       print(a-b)
    end

usage:

    require "mymath.add"
    mymath.add.test2()

alternative

    -- file: finance/BankAccount.lua
    
    local M = {}; M.__index = M
    
    local function construct()
      local self = setmetatable({balance = 0}, M)
      return self
    end
    setmetatable(M, {__call = construct})
    
    function M:add(value) self.balance = self.balance + value end
    
    return M

usage:

    local BankAccount = require "finance.BankAccount"
    local account = BankAccount()


<a id="org0b2219d"></a>

# Standard Libraries


<a id="orga5b44a3"></a>

## basic

-   assert (v [, message])		Calls **error** if **v** is false.
-   collectgarbage ([opt [, arg]])	opt:"collect", "stop", "restart", "count", "step", "setpause", "setstepmul", "isrunning"
-   dofile ([filename])			Opens the named file and executes its contents as a Lua chunk.
-   error (message [, level])		levels = 1 (default) - position where error was called, 2 - function that call error
-   \_G					variable of type table - holds the global environment
-   getmetatable (object)		not have = nil, the object's metatable \_<sub>metatable</sub> field or metatable of the object
-   ipairs (t)				used in:  for i,v in ipairs(t) do  (1,t[1]), (2,t[2]), &#x2026;,
-   load (chunk [, chunkname [, mode [, env]]]) chunk is a string of function that return string.
-   loadfile ([filename [, mode [, env]]])  gets the chunk from file filename
-   next (table [, index])		returns the next index of the table and its associated value.
-   pairs (t)				for k,v in pairs(t) do body end - over all key–value pairs of table t. **next**
-   pcall (f [, arg1, ···])		protected mode - error inside f is not propagated. ret: (true, return) or (false, message)
-   print (···)				any number of arguments, to stdout. **tostring**. for quick way only. use **string.format** and **io.write**.
-   rawequal (v1, v2)			bool, v1 is equal to v2, without invoking the \_<sub>eq</sub> metamethod.
-   rawget (table, index)		table[index], without invoking the \_<sub>index</sub> metamethod. index - any value.
-   rawlen (v)				v - string or table, without invoking the \_<sub>len</sub> metamethod. integer
-   rawset (table, index, value)		table[index], without invoking the \_<sub>newindex</sub>. returns table.
-   select (index, ···)			number - return next elemets &#x2026; after number, '#' - count of &#x2026; elements.
-   setmetatable (table, metatable)
-   tonumber (e [, base])		base - any integer between 2 and 36. return int or nil.
-   tostring (v)				call \_<sub>tostring</sub>.
-   type (v)				return type coded as a string. "nil", "number", "string", "boolean", "table", "function", "thread", and "userdata".
-   \_VERSION				string - the running Lua version.
-   xpcall (f, msgh [, arg1, ···])	This function is similar to pcall, except that it sets a new message handler msgh.

other

-   require (modname)


<a id="org0c74390"></a>

## other

-   coroutine.
-   package.
-   string.
-   utf8.
-   table.
-   math.
-   io.
-   file:
-   os:
-   debug.
-   


<a id="org3a2c8eb"></a>

# debug

assert (v [, message])  - Calls error if the value of its argument v is false


<a id="org2a96993"></a>

# Documenting

-   luadoc 1999-2008 <http://keplerproject.github.io/luadoc/>
-   ldoc <http://stevedonovan.github.io/ldoc/>
    -   LDoc is a LuaDoc-compatible documentation generator which can also process C extension source
-   ExpLua - code comment format and a tool for extracting said comments and exporting HTML, LaTeX, and whatnot

LuaDoc looks for the sequence of three minus signs (&#x2014;). This sequence of characters indicates the beginning
of a documented comment. The documentation ends with the first line of code found.
