lua.html
<div id="outline-container-orgd0d5729" class="outline-3">
<h3 id="orgd0d5729"><span class="section-number-3">15.1.</span> Tags</h3>
<div class="outline-text-3" id="text-15-1">
<p>
LuaDoc can parse some tags at each function or table documentation. Tags are indicated in the source code with
 a `@' character followed by the name of the tag:
</p>

<dl class="org-dl">
<dt>@author &lt;text&gt;</dt><dd>An author of the module or file.</dd>
<dt>@copyright &lt;text&gt;</dt><dd>The copyright notice of the module or file. LuaDoc adds a © sign between the label
(Copyright) and the given text (e.g. 2004-2007 Kepler Project).</dd>
<dt>@field</dt><dd>Describe a table field definition.</dd>
<dt>@param &lt;word&gt; &lt;text&gt;</dt><dd>Describe function parameters. It requires the name of the parameter and its description.</dd>
<dt>@release &lt;text&gt;</dt><dd>Free format string to describe the module or file release.</dd>
<dt>@return &lt;text&gt;</dt><dd>Describe a returning value of the function. Since Lua can return multiple values, this tag
should appear more than once.</dd>
<dt>@see &lt;text&gt;</dt><dd>Refers to other descriptions of functions or tables.</dd>
<dt>@usage &lt;text&gt;</dt><dd>Describe the usage of the function or variable.</dd>
</dl>
</div>
</div>

<div id="outline-container-orgbb6b2e9" class="outline-3">
<h3 id="orgbb6b2e9"><span class="section-number-3">15.2.</span> Infered Tags</h3>
<div class="outline-text-3" id="text-15-2">
<p>
The following tags would be normally infered by LuaDoc, but they can be used to override the infered value.
</p>

<dl class="org-dl">
<dt>@class &lt;word&gt;</dt><dd>If LuaDoc cannot infer the type of documentation (function, table or module definition),
the programmer can specify it explicitly.</dd>
<dt>@description</dt><dd>The description of the function or table. This is usually infered automatically.</dd>
<dt>@name &lt;word&gt;</dt><dd>The name of the function or table definition. This is usually infered from the code
analysis, and the programmer does not need to define it. If LuaDoc can infer the name of the function
automatically it's even not recomended to define the name explicitly, to avoid redundancy.</dd>
</dl>
</div>
</div>

<div id="outline-container-org859cf35" class="outline-3">
<h3 id="org859cf35"><span class="section-number-3">15.3.</span> LDoc style</h3>
<div class="outline-text-3" id="text-15-3">
<div class="org-src-container">
<pre class="src src-lua">--- summary.
-- Description; this can extend over
-- several lines

-----------------
-- This will also do.

You can also use Lua block comments:

--[[--
 Summary. A description
 ...;
]]

</pre>
</div>
</div>
</div>
<div id="outline-container-orgf38588c" class="outline-3">
<h3 id="orgf38588c"><span class="section-number-3">15.4.</span> LDoc tags</h3>
<div class="outline-text-3" id="text-15-4">
<ol class="org-ol">
<li>@module A Lua module containing functions and tables, which may be inside sections</li>
<li>@classmod Like @module but describing a class</li>
<li>@submodule A file containing definitions that you wish to put into the named master module</li>
<li>@script A Lua program</li>
<li>@author (multiple), copyright, @license, @release only used for project-level tags like @module</li>
<li>@function, @lfunction. Functions inside a module</li>
<li>@param formal arguments of a function (multiple)</li>
<li>@return returned values of a function (multiple)</li>
<li>@raise unhandled error thrown by this function</li>
<li>@local explicitly marks a function as not being exported (unless &#x2013;all)</li>
<li>@see reference other documented items</li>
<li>@usage give an example of a function’s use. (Has a somewhat different meaning when used with @module)</li>
<li>@table a Lua table</li>
<li>@field a named member of a table</li>
<li>@section starting a named section for grouping functions or tables together</li>
<li>@type a section which describes a class</li>
<li>@within puts the function or table into an implicit section</li>
<li>@fixme, @todo and @warning are annotations, which are doc comments that occur inside a function body.</li>
</ol>
</div>
</div>

<div id="outline-container-orgbabee1b" class="outline-3">
<h3 id="orgbabee1b"><span class="section-number-3">15.5.</span> table - classic way</h3>
<div class="outline-text-3" id="text-15-5">
<div class="org-src-container">
<pre class="src src-julia">--- a useful table of constants
-- @field alpha first correction
-- @field beta second correction
-- @field gamma fudge factor
-- @table constants
</pre>
</div>
</div>
</div>
<div id="outline-container-org793f3b8" class="outline-3">
<h3 id="org793f3b8"><span class="section-number-3">15.6.</span> Doxygen - Generate documentation from source code</h3>
<div class="outline-text-3" id="text-15-6">
<div class="org-src-container">
<pre class="src src-julia">---------------------------------
--! @file
--! @brief a Doxygen::Lua example
---------------------------------

PARAMETER = {
    --! table is supported
    a = 1,
    b = 2, --! end of line comment is also supported
    c = 3,
}

--! my name
AUTHOR = 'Alec Chen'

--! my email
EMAIL = 'alec@cpan.org'

--! @brief The factorial is an example of a recursive function
--! @param n a positive integer
--! @return return the product of all positive integers less than or equal to n

function factorial(n)
    x = 10
    y = 20
    if n == 0 then
        return 1
    else
        return n * factorial(n - 1)
    end
end

--! @brief a simple function declared local
local function localFunction()
end

--! a function namespace
luaCharacter = inheritsFrom( nil, "luaCharacter" )

--! @brief luaCharacter:reset
function luaCharacter:reset()
end

--! @brief luaCharacter:destroy
function luaCharacter:destroy()
end

--! @brief luaCharacter:entry_point
function luaCharacter:entry_point()
end

</pre>
</div>
</div>
</div>
<div id="outline-container-org8c6b612" class="outline-3">
<h3 id="org8c6b612"><span class="section-number-3">15.7.</span> links</h3>
<div class="outline-text-3" id="text-15-7">
<p>
<a href="http://lua-users.org/wiki/DocumentingLuaCode">http://lua-users.org/wiki/DocumentingLuaCode</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org77be624" class="outline-2">
<h2 id="org77be624"><span class="section-number-2">16.</span> Style guide</h2>
<div class="outline-text-2" id="text-16">
<p>
Python style is a reference.
</p>
</div>
