lua.md


<a id="org961962a"></a>

## Tags

LuaDoc can parse some tags at each function or table documentation. Tags are indicated in the source code with
 a \`@' character followed by the name of the tag:

-   **@author <text>:** An author of the module or file.
-   **@copyright <text>:** The copyright notice of the module or file. LuaDoc adds a © sign between the label
    (Copyright) and the given text (e.g. 2004-2007 Kepler Project).
-   **@field:** Describe a table field definition.
-   **@param <word> <text>:** Describe function parameters. It requires the name of the parameter and its description.
-   **@release <text>:** Free format string to describe the module or file release.
-   **@return <text>:** Describe a returning value of the function. Since Lua can return multiple values, this tag
    should appear more than once.
-   **@see <text>:** Refers to other descriptions of functions or tables.
-   **@usage <text>:** Describe the usage of the function or variable.


<a id="org1847b75"></a>

## Infered Tags

The following tags would be normally infered by LuaDoc, but they can be used to override the infered value.

-   **@class <word>:** If LuaDoc cannot infer the type of documentation (function, table or module definition),
    the programmer can specify it explicitly.
-   **@description:** The description of the function or table. This is usually infered automatically.
-   **@name <word>:** The name of the function or table definition. This is usually infered from the code
    analysis, and the programmer does not need to define it. If LuaDoc can infer the name of the function
    automatically it's even not recomended to define the name explicitly, to avoid redundancy.


<a id="orgdae85ac"></a>

## LDoc style

    --- summary.
    -- Description; this can extend over
    -- several lines
    
    -----------------
    -- This will also do.
    
    You can also use Lua block comments:
    
    --[[--
     Summary. A description
     ...;
    ]]


<a id="org27cd5ea"></a>

## LDoc tags

1.  @module A Lua module containing functions and tables, which may be inside sections
2.  @classmod Like @module but describing a class
3.  @submodule A file containing definitions that you wish to put into the named master module
4.  @script A Lua program
5.  @author (multiple), copyright, @license, @release only used for project-level tags like @module
6.  @function, @lfunction. Functions inside a module
7.  @param formal arguments of a function (multiple)
8.  @return returned values of a function (multiple)
9.  @raise unhandled error thrown by this function
10. @local explicitly marks a function as not being exported (unless &#x2013;all)
11. @see reference other documented items
12. @usage give an example of a function’s use. (Has a somewhat different meaning when used with @module)
13. @table a Lua table
14. @field a named member of a table
15. @section starting a named section for grouping functions or tables together
16. @type a section which describes a class
17. @within puts the function or table into an implicit section
18. @fixme, @todo and @warning are annotations, which are doc comments that occur inside a function body.


<a id="org7dc6890"></a>

## table - classic way

    --- a useful table of constants
    -- @field alpha first correction
    -- @field beta second correction
    -- @field gamma fudge factor
    -- @table constants


<a id="org5647529"></a>

## Doxygen - Generate documentation from source code

    ---------------------------------
    --! @file
    --! @brief a Doxygen::Lua example
    ---------------------------------
    
    PARAMETER = {
        --! table is supported
        a = 1,
        b = 2, --! end of line comment is also supported
        c = 3,
    }
    
    --! my name
    AUTHOR = 'Alec Chen'
    
    --! my email
    EMAIL = 'alec@cpan.org'
    
    --! @brief The factorial is an example of a recursive function
    --! @param n a positive integer
    --! @return return the product of all positive integers less than or equal to n
    
    function factorial(n)
        x = 10
        y = 20
        if n == 0 then
            return 1
        else
            return n * factorial(n - 1)
        end
    end
    
    --! @brief a simple function declared local
    local function localFunction()
    end
    
    --! a function namespace
    luaCharacter = inheritsFrom( nil, "luaCharacter" )
    
    --! @brief luaCharacter:reset
    function luaCharacter:reset()
    end
    
    --! @brief luaCharacter:destroy
    function luaCharacter:destroy()
    end
    
    --! @brief luaCharacter:entry_point
    function luaCharacter:entry_point()
    end


<a id="org2b79715"></a>

## links

<http://lua-users.org/wiki/DocumentingLuaCode>


<a id="org5696d91"></a>

# Style guide

Python style is a reference.
