sources_org/lua.org
** basic
*Formatting*
- Indentation - Indenting often uses two spaces.

*Naming*
- lenght - variable names with larger scope should be more descriptive than those with smaller scope.

*variables*
- lowercase - Variables holding values or objects are typically lowercase and short (e.g. color)
- Booleans - It can be helpful to prefix Boolean values or functions used as predicates with is, such as
 is_directory rather than directory (which might store a directory object itself).
- underscore "_" is commonly used as a placeholder when you want to ignore the variable
- i, k, v, t
: for k,v in pairs(t) ... end
: for i,v in ipairs(t) ... end
: mt.__newindex = function(t, k, v) ... end
M is sometimes used as the "current module table"

- functions - print_table or getmetatable.
- constants - ALL_CAPS, with words optionally separated by underscores.
- module/package -  nouns with names that are short and lowercase, with nothing between words.
- Class names - upper CamelCase

*libraries* - Avoid using the debug library unless necessary, especially if trusted code is being run.

Use *local*! Globals have larger scopes and lifetimes and therefore increase [coupling] and complexity
- limit the scope of local variables with do-blocks

Don't use semicolons *;*. They are generally only useful to separate multiple statements on a single line, but
 you shouldn't be putting multiple statements on a single line anyway.
** require
** links
- http://lua-users.org/wiki/LuaStyleGuide
- https://roblox.github.io/lua-style-guide/
- https://github.com/luarocks/lua-style-guide
* The Complete Syntax of Lua
Here is the complete syntax of Lua in extended BNF. As usual in extended BNF, {A} means 0 or more As, and [A]
 means an optional A.
#+begin_src text
	chunk ::= block

	block ::= {stat} [retstat]

	stat ::=  ‘;’ |
		 varlist ‘=’ explist |
		 functioncall |
		 label |
		 break |
		 goto Name |
		 do block end |
		 while exp do block end |
		 repeat block until exp |
		 if exp then block {elseif exp then block} [else block] end |
		 for Name ‘=’ exp ‘,’ exp [‘,’ exp] do block end |
		 for namelist in explist do block end |
		 function funcname funcbody |
		 local function Name funcbody |
		 local namelist [‘=’ explist]

	retstat ::= return [explist] [‘;’]

	label ::= ‘::’ Name ‘::’

	funcname ::= Name {‘.’ Name} [‘:’ Name]

	varlist ::= var {‘,’ var}

	var ::=  Name | prefixexp ‘[’ exp ‘]’ | prefixexp ‘.’ Name

	namelist ::= Name {‘,’ Name}

	explist ::= exp {‘,’ exp}

	exp ::=  nil | false | true | Numeral | LiteralString | ‘...’ | functiondef |
		 prefixexp | tableconstructor | exp binop exp | unop exp

	prefixexp ::= var | functioncall | ‘(’ exp ‘)’

	functioncall ::=  prefixexp args | prefixexp ‘:’ Name args

	args ::=  ‘(’ [explist] ‘)’ | tableconstructor | LiteralString

	functiondef ::= function funcbody

	funcbody ::= ‘(’ [parlist] ‘)’ block end

	parlist ::= namelist [‘,’ ‘...’] | ‘...’

	tableconstructor ::= ‘{’ [fieldlist] ‘}’

	fieldlist ::= field {fieldsep field} [fieldsep]

	field ::= ‘[’ exp ‘]’ ‘=’ exp | Name ‘=’ exp | exp

	fieldsep ::= ‘,’ | ‘;’

	binop ::=  ‘+’ | ‘-’ | ‘*’ | ‘/’ | ‘//’ | ‘^’ | ‘%’ |
		 ‘&’ | ‘~’ | ‘|’ | ‘>>’ | ‘<<’ | ‘..’ |
		 ‘<’ | ‘<=’ | ‘>’ | ‘>=’ | ‘==’ | ‘~=’ |
		 and | or

	unop ::= ‘-’ | not | ‘#’ | ‘~’

#+end_src

* TODO not errors
** undefined variable
#+begin_src lua
a=b -- a = nil
#+end_src
** key not present
Indexing into a table in Lua gives you nil if the key isn't present.
#+begin_src lua :results output :exports both
local MyEnum = {
    A = "A",
    B = "B",
    C = "CC",
}

print(MyEnum.V) -- nil

setmetatable(MyEnum, {
    __index = function(self, key)
        error(string.format("%q is not a valid member of MyEnum",
            tostring(key)), 2)
    end,
})

print(MyEnum.C) -- CC
print(MyEnum.V) -- error
#+end_src

#+RESULTS:
: nil
: CC

* package managers
LuaRocks - MIT - https://luarocks.org/
