lua.html
<div id="outline-container-org3f7c760" class="outline-3">
<h3 id="org3f7c760"><span class="section-number-3">16.1.</span> basic</h3>
<div class="outline-text-3" id="text-16-1">
<p>
<b>Formatting</b>
</p>
<ul class="org-ul">
<li>Indentation - Indenting often uses two spaces.</li>
</ul>

<p>
<b>Naming</b>
</p>
<ul class="org-ul">
<li>lenght - variable names with larger scope should be more descriptive than those with smaller scope.</li>
</ul>

<p>
<b>variables</b>
</p>
<ul class="org-ul">
<li>lowercase - Variables holding values or objects are typically lowercase and short (e.g. color)</li>
<li>Booleans - It can be helpful to prefix Boolean values or functions used as predicates with is, such as
is<sub>directory</sub> rather than directory (which might store a directory object itself).</li>
<li>underscore "_" is commonly used as a placeholder when you want to ignore the variable</li>
<li>i, k, v, t</li>
</ul>
<pre class="example">
for k,v in pairs(t) ... end
for i,v in ipairs(t) ... end
mt.__newindex = function(t, k, v) ... end
</pre>

<p>
M is sometimes used as the "current module table"
</p>

<ul class="org-ul">
<li>functions - print<sub>table</sub> or getmetatable.</li>
<li>constants - ALL<sub>CAPS</sub>, with words optionally separated by underscores.</li>
<li>module/package -  nouns with names that are short and lowercase, with nothing between words.</li>
<li>Class names - upper CamelCase</li>
</ul>

<p>
<b>libraries</b> - Avoid using the debug library unless necessary, especially if trusted code is being run.
</p>

<p>
Use <b>local</b>! Globals have larger scopes and lifetimes and therefore increase [coupling] and complexity
</p>
<ul class="org-ul">
<li>limit the scope of local variables with do-blocks</li>
</ul>

<p>
Don't use semicolons <b>;</b>. They are generally only useful to separate multiple statements on a single line, but
 you shouldn't be putting multiple statements on a single line anyway.
</p>
</div>
</div>
<div id="outline-container-org26fcb87" class="outline-3">
<h3 id="org26fcb87"><span class="section-number-3">16.2.</span> require</h3>
</div>
<div id="outline-container-org806926a" class="outline-3">
<h3 id="org806926a"><span class="section-number-3">16.3.</span> links</h3>
<div class="outline-text-3" id="text-16-3">
<ul class="org-ul">
<li><a href="http://lua-users.org/wiki/LuaStyleGuide">http://lua-users.org/wiki/LuaStyleGuide</a></li>
<li><a href="https://roblox.github.io/lua-style-guide/">https://roblox.github.io/lua-style-guide/</a></li>
<li><a href="https://github.com/luarocks/lua-style-guide">https://github.com/luarocks/lua-style-guide</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5324faa" class="outline-2">
<h2 id="org5324faa"><span class="section-number-2">17.</span> The Complete Syntax of Lua</h2>
<div class="outline-text-2" id="text-17">
<p>
Here is the complete syntax of Lua in extended BNF. As usual in extended BNF, {A} means 0 or more As, and [A]
 means an optional A.
</p>
<div class="org-src-container">
<pre class="src src-text">        chunk ::= block

        block ::= {stat} [retstat]

        stat ::=  &#8216;;&#8217; |
                 varlist &#8216;=&#8217; explist |
                 functioncall |
                 label |
                 break |
                 goto Name |
                 do block end |
                 while exp do block end |
                 repeat block until exp |
                 if exp then block {elseif exp then block} [else block] end |
                 for Name &#8216;=&#8217; exp &#8216;,&#8217; exp [&#8216;,&#8217; exp] do block end |
                 for namelist in explist do block end |
                 function funcname funcbody |
                 local function Name funcbody |
                 local namelist [&#8216;=&#8217; explist]

        retstat ::= return [explist] [&#8216;;&#8217;]

        label ::= &#8216;::&#8217; Name &#8216;::&#8217;

        funcname ::= Name {&#8216;.&#8217; Name} [&#8216;:&#8217; Name]

        varlist ::= var {&#8216;,&#8217; var}

        var ::=  Name | prefixexp &#8216;[&#8217; exp &#8216;]&#8217; | prefixexp &#8216;.&#8217; Name

        namelist ::= Name {&#8216;,&#8217; Name}

        explist ::= exp {&#8216;,&#8217; exp}

        exp ::=  nil | false | true | Numeral | LiteralString | &#8216;...&#8217; | functiondef |
                 prefixexp | tableconstructor | exp binop exp | unop exp

        prefixexp ::= var | functioncall | &#8216;(&#8217; exp &#8216;)&#8217;

        functioncall ::=  prefixexp args | prefixexp &#8216;:&#8217; Name args

        args ::=  &#8216;(&#8217; [explist] &#8216;)&#8217; | tableconstructor | LiteralString

        functiondef ::= function funcbody

        funcbody ::= &#8216;(&#8217; [parlist] &#8216;)&#8217; block end

        parlist ::= namelist [&#8216;,&#8217; &#8216;...&#8217;] | &#8216;...&#8217;

        tableconstructor ::= &#8216;{&#8217; [fieldlist] &#8216;}&#8217;

        fieldlist ::= field {fieldsep field} [fieldsep]

        field ::= &#8216;[&#8217; exp &#8216;]&#8217; &#8216;=&#8217; exp | Name &#8216;=&#8217; exp | exp

        fieldsep ::= &#8216;,&#8217; | &#8216;;&#8217;

        binop ::=  &#8216;+&#8217; | &#8216;-&#8217; | &#8216;*&#8217; | &#8216;/&#8217; | &#8216;//&#8217; | &#8216;^&#8217; | &#8216;%&#8217; |
                 &#8216;&amp;&#8217; | &#8216;~&#8217; | &#8216;|&#8217; | &#8216;&gt;&gt;&#8217; | &#8216;&lt;&lt;&#8217; | &#8216;..&#8217; |
                 &#8216;&lt;&#8217; | &#8216;&lt;=&#8217; | &#8216;&gt;&#8217; | &#8216;&gt;=&#8217; | &#8216;==&#8217; | &#8216;~=&#8217; |
                 and | or

        unop ::= &#8216;-&#8217; | not | &#8216;#&#8217; | &#8216;~&#8217;

</pre>
</div>
</div>
</div>

<div id="outline-container-org856c361" class="outline-2">
<h2 id="org856c361"><span class="section-number-2">18.</span> <span class="todo TODO">TODO</span> not errors</h2>
<div class="outline-text-2" id="text-18">
</div>
<div id="outline-container-orgdcdf794" class="outline-3">
<h3 id="orgdcdf794"><span class="section-number-3">18.1.</span> undefined variable</h3>
<div class="outline-text-3" id="text-18-1">
<div class="org-src-container">
<pre class="src src-lua">a=b -- a = nil
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc962bd8" class="outline-3">
<h3 id="orgc962bd8"><span class="section-number-3">18.2.</span> key not present</h3>
<div class="outline-text-3" id="text-18-2">
<p>
Indexing into a table in Lua gives you nil if the key isn't present.
</p>
<div class="org-src-container">
<pre class="src src-lua">local MyEnum = {
    A = "A",
    B = "B",
    C = "CC",
}

print(MyEnum.V) -- nil

setmetatable(MyEnum, {
    __index = function(self, key)
        error(string.format("%q is not a valid member of MyEnum",
            tostring(key)), 2)
    end,
})

print(MyEnum.C) -- CC
print(MyEnum.V) -- error
</pre>
</div>

<pre class="example">
nil
CC
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdfd5705" class="outline-2">
<h2 id="orgdfd5705"><span class="section-number-2">19.</span> package managers</h2>
<div class="outline-text-2" id="text-19">
<p>
LuaRocks - MIT - <a href="https://luarocks.org/">https://luarocks.org/</a>
</p>
</div>
</div>
