lua.md


<a id="orgaa2b583"></a>

## basic

**Formatting**

-   Indentation - Indenting often uses two spaces.

**Naming**

-   lenght - variable names with larger scope should be more descriptive than those with smaller scope.

**variables**

-   lowercase - Variables holding values or objects are typically lowercase and short (e.g. color)
-   Booleans - It can be helpful to prefix Boolean values or functions used as predicates with is, such as
    is<sub>directory</sub> rather than directory (which might store a directory object itself).
-   underscore "\_" is commonly used as a placeholder when you want to ignore the variable
-   i, k, v, t

    for k,v in pairs(t) ... end
    for i,v in ipairs(t) ... end
    mt.__newindex = function(t, k, v) ... end

M is sometimes used as the "current module table"

-   functions - print<sub>table</sub> or getmetatable.
-   constants - ALL<sub>CAPS</sub>, with words optionally separated by underscores.
-   module/package -  nouns with names that are short and lowercase, with nothing between words.
-   Class names - upper CamelCase

**libraries** - Avoid using the debug library unless necessary, especially if trusted code is being run.

Use **local**! Globals have larger scopes and lifetimes and therefore increase [coupling] and complexity

-   limit the scope of local variables with do-blocks

Don't use semicolons **;**. They are generally only useful to separate multiple statements on a single line, but
 you shouldn't be putting multiple statements on a single line anyway.


<a id="orgc460115"></a>

## require


<a id="orga161e28"></a>

## links

-   <http://lua-users.org/wiki/LuaStyleGuide>
-   <https://roblox.github.io/lua-style-guide/>
-   <https://github.com/luarocks/lua-style-guide>


<a id="org0d38ad3"></a>

# The Complete Syntax of Lua

Here is the complete syntax of Lua in extended BNF. As usual in extended BNF, {A} means 0 or more As, and [A]
 means an optional A.

    chunk ::= block
    
    block ::= {stat} [retstat]
    
    stat ::=  ‘;’ |
    	 varlist ‘=’ explist |
    	 functioncall |
    	 label |
    	 break |
    	 goto Name |
    	 do block end |
    	 while exp do block end |
    	 repeat block until exp |
    	 if exp then block {elseif exp then block} [else block] end |
    	 for Name ‘=’ exp ‘,’ exp [‘,’ exp] do block end |
    	 for namelist in explist do block end |
    	 function funcname funcbody |
    	 local function Name funcbody |
    	 local namelist [‘=’ explist]
    
    retstat ::= return [explist] [‘;’]
    
    label ::= ‘::’ Name ‘::’
    
    funcname ::= Name {‘.’ Name} [‘:’ Name]
    
    varlist ::= var {‘,’ var}
    
    var ::=  Name | prefixexp ‘[’ exp ‘]’ | prefixexp ‘.’ Name
    
    namelist ::= Name {‘,’ Name}
    
    explist ::= exp {‘,’ exp}
    
    exp ::=  nil | false | true | Numeral | LiteralString | ‘...’ | functiondef |
    	 prefixexp | tableconstructor | exp binop exp | unop exp
    
    prefixexp ::= var | functioncall | ‘(’ exp ‘)’
    
    functioncall ::=  prefixexp args | prefixexp ‘:’ Name args
    
    args ::=  ‘(’ [explist] ‘)’ | tableconstructor | LiteralString
    
    functiondef ::= function funcbody
    
    funcbody ::= ‘(’ [parlist] ‘)’ block end
    
    parlist ::= namelist [‘,’ ‘...’] | ‘...’
    
    tableconstructor ::= ‘{’ [fieldlist] ‘}’
    
    fieldlist ::= field {fieldsep field} [fieldsep]
    
    field ::= ‘[’ exp ‘]’ ‘=’ exp | Name ‘=’ exp | exp
    
    fieldsep ::= ‘,’ | ‘;’
    
    binop ::=  ‘+’ | ‘-’ | ‘*’ | ‘/’ | ‘//’ | ‘^’ | ‘%’ |
    	 ‘&’ | ‘~’ | ‘|’ | ‘>>’ | ‘<<’ | ‘..’ |
    	 ‘<’ | ‘<=’ | ‘>’ | ‘>=’ | ‘==’ | ‘~=’ |
    	 and | or
    
    unop ::= ‘-’ | not | ‘#’ | ‘~’


<a id="orgab35aa2"></a>

# TODO not errors


<a id="orgb2a6ea5"></a>

## undefined variable

    a=b -- a = nil


<a id="orgde95be9"></a>

## key not present

Indexing into a table in Lua gives you nil if the key isn't present.

    local MyEnum = {
        A = "A",
        B = "B",
        C = "CC",
    }
    
    print(MyEnum.V) -- nil
    
    setmetatable(MyEnum, {
        __index = function(self, key)
            error(string.format("%q is not a valid member of MyEnum",
                tostring(key)), 2)
        end,
    })
    
    print(MyEnum.C) -- CC
    print(MyEnum.V) -- error

    nil
    CC


<a id="org5637444"></a>

# package managers

LuaRocks - MIT - <https://luarocks.org/>
