sources_org/lua.org
* links
- books
  - Lua Reference Manual https://www.lua.org/manual/5.3
  - "Programming in Lua" http://www.lua.org/pil/
  - lua-users wiki http://lua-users.org/wiki/
  - book http://lua-users.org/wiki/LuaBooks
  - *Beginning Lua Programming* - book for sale.
- module http://www.keplerproject.org/
- module http://lua-users.org/wiki/LuaForge
