lua.html
<div id="outline-container-org7b6014c" class="outline-2">
<h2 id="org7b6014c"><span class="section-number-2">20.</span> links</h2>
<div class="outline-text-2" id="text-20">
<ul class="org-ul">
<li>books
<ul class="org-ul">
<li>Lua Reference Manual <a href="https://www.lua.org/manual/5.3">https://www.lua.org/manual/5.3</a></li>
<li>"Programming in Lua" <a href="http://www.lua.org/pil/">http://www.lua.org/pil/</a></li>
<li>lua-users wiki <a href="http://lua-users.org/wiki/">http://lua-users.org/wiki/</a></li>
<li>book <a href="http://lua-users.org/wiki/LuaBooks">http://lua-users.org/wiki/LuaBooks</a></li>
<li><b>Beginning Lua Programming</b> - book for sale.</li>
</ul></li>
<li>module <a href="http://www.keplerproject.org/">http://www.keplerproject.org/</a></li>
<li>module <a href="http://lua-users.org/wiki/LuaForge">http://lua-users.org/wiki/LuaForge</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2025-01-14 Tue 12:47</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
